"use strict";

Object.defineProperty(exports, "__esModule", {
  value: true
});
exports.data = void 0;
var data = {
  "data": [{
    "name": "北京",
    "city": [{
      "name": "北京",
      "area": ["东城", "西城", "朝阳", "丰台", "石景山", "海淀", "门头沟", "房山", "通州", "顺义", "昌平", "大兴", "怀柔", "平谷", "密云", "延庆"]
    }]
  }, {
    "name": "天津",
    "city": [{
      "name": "天津",
      "area": ["和平", "河东", "河西", "南开", "河北", "红桥", "东丽", "西青", "津南", "北辰", "武清", "宝坻", "滨海新", "宁河", "静海", "蓟州"]
    }]
  }, {
    "name": "上海",
    "city": [{
      "name": "上海",
      "area": ["黄浦", "徐汇", "长宁", "静安", "普陀", "虹口", "杨浦", "闵行", "宝山", "嘉定", "浦东新", "金山", "松江", "青浦", "奉贤", "崇明"]
    }]
  }, {
    "name": "重庆",
    "city": [{
      "name": "重庆",
      "area": ["万州", "涪陵", "渝中", "大渡口", "江北", "沙坪坝", "九龙坡", "南岸", "北碚", "綦江", "大足", "渝北", "巴南", "黔江", "长寿", "江津", "合川", "永川", "南川", "璧山", "铜梁", "潼南", "荣昌", "开州", "梁平", "武隆", "城口", "丰都", "垫江", "忠县", "云阳", "奉节", "巫山", "巫溪", "石柱", "秀山", "酉阳", "彭水"]
    }]
  }, {
    "name": "河北",
    "city": [{
      "name": "石家庄",
      "area": ["长安", "桥西", "新华", "井陉矿", "井陉", "裕华", "藁城", "鹿泉", "栾城", "井陉", "正定", "行唐", "灵寿", "高邑", "深泽", "赞皇", "无极", "平山", "元氏", "赵县", "辛集", "晋州", "新乐"]
    }, {
      "name": "唐山",
      "area": ["路南", "路北", "古冶", "开平", "丰南", "丰润", "曹妃甸", "滦县", "滦南", "乐亭", "迁西", "玉田", "遵化", "迁安", "滦州"]
    }, {
      "name": "秦皇岛",
      "area": ["海港", "山海关", "北戴河", "抚宁", "青龙", "昌黎", "卢龙"]
    }, {
      "name": "邯郸",
      "area": ["邯山", "丛台", "复兴", "峰峰矿", "肥乡", "永年", "临漳", "成安", "大名", "涉县", "磁县", "邱县", "鸡泽", "广平", "馆陶", "魏县", "曲周", "武安"]
    }, {
      "name": "邢台",
      "area": ["桥东", "桥西", "邢台", "临城", "内丘", "柏乡", "隆尧", "任县", "南和", "宁晋", "巨鹿", "新河", "广宗", "平乡", "威县", "清河", "临西", "南宫", "沙河"]
    }, {
      "name": "保定",
      "area": ["竞秀", "莲池", "满城", "清苑", "徐水", "涞水", "阜平", "定兴", "唐县", "高阳", "容城", "涞源", "望都", "安新", "易县", "曲阳", "蠡县", "顺平", "博野", "雄县", "涿州", "定州", "安国", "高碑店"]
    }, {
      "name": "张家口",
      "area": ["桥东", "桥西", "宣化", "下花园", "万全", "崇礼", "张北", "康保", "沽源", "尚义", "蔚县", "阳原", "怀安", "怀来", "涿鹿", "赤城"]
    }, {
      "name": "承德",
      "area": ["双桥", "双滦", "鹰手营子矿", "承德", "兴隆", "滦平", "隆化", "丰宁", "宽城", "围场", "平泉"]
    }, {
      "name": "沧州",
      "area": ["新华", "运河", "沧县", "青县", "东光", "海兴", "盐山", "肃宁", "南皮", "吴桥", "献县", "孟村", "泊头", "任丘", "黄骅", "河间"]
    }, {
      "name": "廊坊",
      "area": ["安次", "广阳", "固安", "永清", "香河", "大城", "文安", "大厂", "霸州", "三河"]
    }, {
      "name": "衡水",
      "area": ["桃城", "冀州", "枣强", "武邑", "武强", "饶阳", "安平", "故城", "景县", "阜城", "深州"]
    }]
  }, {
    "name": "山西",
    "city": [{
      "name": "太原",
      "area": ["小店", "迎泽", "杏花岭", "尖草坪", "万柏林", "晋源", "清徐", "阳曲", "娄烦", "古交"]
    }, {
      "name": "大同",
      "area": ["新荣", "平城", "云冈", "云州", "阳高", "天镇", "广灵", "灵丘", "浑源", "左云"]
    }, {
      "name": "阳泉",
      "area": ["城区", "矿区", "郊区", "平定", "盂县"]
    }, {
      "name": "长治",
      "area": ["城区", "郊区", "长治", "襄垣", "屯留", "平顺", "黎城", "壶关", "长子", "武乡", "沁县", "沁源", "潞州", "上党", "屯留", "潞城"]
    }, {
      "name": "晋城",
      "area": ["城区", "沁水", "阳城", "陵川", "泽州", "高平"]
    }, {
      "name": "朔州",
      "area": ["朔城", "平鲁", "山阴", "应县", "右玉", "怀仁"]
    }, {
      "name": "晋中",
      "area": ["榆次", "榆社", "左权", "和顺", "昔阳", "寿阳", "太谷", "祁县", "平遥", "灵石", "介休"]
    }, {
      "name": "运城",
      "area": ["盐湖", "临猗", "万荣", "闻喜", "稷山", "新绛", "绛县", "垣曲", "夏县", "平陆", "芮城", "永济", "河津"]
    }, {
      "name": "忻州",
      "area": ["忻府", "定襄", "五台", "代县", "繁峙", "宁武", "静乐", "神池", "五寨", "岢岚", "河曲", "保德", "偏关", "原平"]
    }, {
      "name": "临汾",
      "area": ["尧都", "曲沃", "翼城", "襄汾", "洪洞", "古县", "安泽", "浮山", "吉县", "乡宁", "大宁", "隰县", "永和", "蒲县", "汾西", "侯马", "霍州"]
    }, {
      "name": "吕梁",
      "area": ["离石", "文水", "交城", "兴县", "临县", "柳林", "石楼", "岚县", "方山", "中阳", "交口", "孝义", "汾阳"]
    }]
  }, {
    "name": "内蒙古",
    "city": [{
      "name": "呼和浩特",
      "area": ["新城", "回民", "玉泉", "赛罕", "土默特", "托克托", "和林格尔", "清水河", "武川"]
    }, {
      "name": "包头",
      "area": ["东河", "昆都仑", "青山", "石拐", "白云鄂", "九原", "土默特", "固阳", "达尔罕茂明安联合旗"]
    }, {
      "name": "乌海",
      "area": ["海勃湾", "海南", "乌达"]
    }, {
      "name": "赤峰",
      "area": ["红山", "元宝山", "松山", "阿鲁科尔沁旗", "巴林左旗", "巴林右旗", "林西", "克什克腾旗", "翁牛特旗", "喀喇沁旗", "宁城", "敖汉旗"]
    }, {
      "name": "通辽",
      "area": ["科尔沁", "科尔沁左翼中旗", "科尔沁左翼后旗", "开鲁", "库伦旗", "奈曼旗", "扎鲁特旗", "霍林郭勒"]
    }, {
      "name": "鄂尔多斯",
      "area": ["东胜", "康巴什", "达拉特旗", "准格尔旗", "鄂托克前旗", "鄂托克旗", "杭锦旗", "乌审旗", "伊金霍洛旗"]
    }, {
      "name": "呼伦贝尔",
      "area": ["海拉尔", "扎赉诺尔", "阿荣旗", "莫力达瓦达斡尔族自治旗", "鄂伦春自治旗", "鄂温克族自治旗", "陈巴尔虎旗", "新巴尔虎左旗", "新巴尔虎右旗", "满洲里", "牙克石", "扎兰屯", "额尔古纳", "根河"]
    }, {
      "name": "巴彦淖尔",
      "area": ["临河", "五原", "磴口", "乌拉特前旗", "乌拉特中旗", "乌拉特后旗", "杭锦后旗"]
    }, {
      "name": "乌兰察布",
      "area": ["集宁", "卓资", "化德", "商都", "兴和", "凉城", "察哈尔右翼前旗", "察哈尔右翼中旗", "察哈尔右翼后旗", "四子王旗", "丰镇"]
    }, {
      "name": "兴安盟",
      "area": ["乌兰浩特", "阿尔山", "科尔沁右翼前旗", "科尔沁右翼中旗", "扎赉特旗", "突泉"]
    }, {
      "name": "锡林郭勒",
      "area": ["二连浩特", "锡林浩特", "阿巴嘎旗", "苏尼特左旗", "苏尼特右旗", "东乌珠穆沁旗", "西乌珠穆沁旗", "太仆寺旗", "镶黄旗", "正镶白旗", "正蓝旗", "多伦"]
    }, {
      "name": "阿拉善",
      "area": ["阿拉善左旗", "阿拉善右旗", "额济纳旗"]
    }]
  }, {
    "name": "辽宁",
    "city": [{
      "name": "沈阳",
      "area": ["和平", "沈河", "大东", "皇姑", "铁西", "苏家屯", "浑南", "沈北新", "于洪", "辽中", "康平", "法库", "新民"]
    }, {
      "name": "大连",
      "area": ["中山", "西岗", "沙河口", "甘井子", "旅顺口", "金州", "普兰店", "长海", "瓦房店", "庄河"]
    }, {
      "name": "鞍山",
      "area": ["铁东", "铁西", "立山", "千山", "台安", "岫岩", "海城"]
    }, {
      "name": "抚顺",
      "area": ["新抚", "东洲", "望花", "顺城", "抚顺", "新宾", "清原"]
    }, {
      "name": "本溪",
      "area": ["平山", "溪湖", "明山", "南芬", "本溪", "桓仁"]
    }, {
      "name": "丹东",
      "area": ["元宝", "振兴", "振安", "宽甸", "东港", "凤城"]
    }, {
      "name": "锦州",
      "area": ["古塔", "韬忧", "太和", "黑山", "义县", "凌海", "北镇", "凌河"]
    }, {
      "name": "营口",
      "area": ["站前", "西市", "鲅鱼圈", "老边", "盖州", "大石桥"]
    }, {
      "name": "阜新",
      "area": ["海州", "新邱", "太平", "清河门", "细河", "阜新", "彰武"]
    }, {
      "name": "辽阳",
      "area": ["白塔", "文圣", "宏伟", "弓长岭", "太子河", "辽阳", "灯塔"]
    }, {
      "name": "盘锦",
      "area": ["双台子", "兴隆台", "大洼", "盘山"]
    }, {
      "name": "铁岭",
      "area": ["银州", "清河", "铁岭", "西丰", "昌图", "调兵山", "开原"]
    }, {
      "name": "朝阳",
      "area": ["双塔", "龙城", "朝阳", "建平", "喀喇沁左翼", "北票", "凌源"]
    }, {
      "name": "葫芦岛",
      "area": ["连山", "龙港", "南票", "绥中", "建昌", "兴城"]
    }]
  }, {
    "name": "吉林",
    "city": [{
      "name": "长春",
      "area": ["南关", "宽城", "朝阳", "二道", "绿园", "双阳", "九台", "农安", "榆树", "德惠"]
    }, {
      "name": "吉林",
      "area": ["昌邑", "龙潭", "船营", "丰满", "永吉", "蛟河", "桦甸", "舒兰", "磐石"]
    }, {
      "name": "四平",
      "area": ["铁西", "铁东", "梨树", "伊通", "公主岭", "双辽"]
    }, {
      "name": "辽源",
      "area": ["龙山", "西安", "东丰", "东辽"]
    }, {
      "name": "通化",
      "area": ["东昌", "二道江", "通化", "辉南", "柳河", "梅河口", "集安"]
    }, {
      "name": "白山",
      "area": ["浑江", "江源", "抚松", "靖宇", "长白", "临江"]
    }, {
      "name": "松原",
      "area": ["宁江", "前郭尔罗斯", "长岭", "乾安", "扶余"]
    }, {
      "name": "白城",
      "area": ["洮北", "镇赉", "通榆", "洮南", "大安"]
    }, {
      "name": "延边",
      "area": ["延吉", "图们", "敦化", "珲春", "龙井", "和龙", "汪清", "安图"]
    }]
  }, {
    "name": "黑龙江",
    "city": [{
      "name": "哈尔滨",
      "area": ["道里", "南岗", "道外", "平房", "松北", "香坊", "呼兰", "阿城", "双城", "依兰", "方正", "宾县", "巴彦", "木兰", "通河", "延寿", "尚志", "五常"]
    }, {
      "name": "齐齐哈尔",
      "area": ["龙沙", "建华", "铁锋", "昂昂溪", "富拉尔基", "碾子山", "梅里斯", "龙江", "依安", "泰来", "甘南", "富裕", "克山", "克东", "拜泉", "讷河"]
    }, {
      "name": "鸡西",
      "area": ["鸡冠", "恒山", "滴道", "梨树", "城子河", "麻山", "鸡东", "虎林", "密山"]
    }, {
      "name": "鹤岗",
      "area": ["向阳", "工农", "南山", "兴安", "东山", "兴山", "萝北", "绥滨"]
    }, {
      "name": "双鸭山",
      "area": ["尖山", "岭东", "四方台", "宝山", "集贤", "友谊", "宝清", "饶河"]
    }, {
      "name": "大庆",
      "area": ["萨尔图", "龙凤", "让胡路", "红岗", "大同", "肇州", "肇源", "林甸", "杜尔伯特"]
    }, {
      "name": "伊春",
      "area": ["伊春", "南岔", "友好", "西林", "翠峦", "新青", "美溪", "金山屯", "五营", "乌马河", "汤旺河", "带岭", "乌伊岭", "红星", "上甘岭", "嘉荫", "铁力"]
    }, {
      "name": "佳木斯",
      "area": ["向阳", "前进", "东风", "郊区", "桦南", "桦川", "汤原", "同江", "富锦", "抚远"]
    }, {
      "name": "七台河",
      "area": ["新兴", "桃山", "茄子河", "勃利"]
    }, {
      "name": "牡丹江",
      "area": ["东安", "阳明", "爱民", "西安", "林口", "绥芬河", "海林", "宁安", "穆棱", "东宁"]
    }, {
      "name": "黑河",
      "area": ["爱辉", "嫩江", "逊克", "孙吴", "北安", "五大连池"]
    }, {
      "name": "绥化",
      "area": ["北林", "望奎", "兰西", "青冈", "庆安", "明水", "绥棱", "安达", "肇东", "海伦"]
    }, {
      "name": "大兴安岭",
      "area": ["呼玛", "塔河", "漠河"]
    }]
  }, {
    "name": "江苏",
    "city": [{
      "name": "南京",
      "area": ["玄武", "秦淮", "建邺", "鼓楼", "浦口", "栖霞", "雨花台", "江宁", "六合", "溧水", "高淳"]
    }, {
      "name": "无锡",
      "area": ["锡山", "惠山", "滨湖", "梁溪", "新吴", "江阴", "宜兴"]
    }, {
      "name": "徐州",
      "area": ["鼓楼", "云龙", "贾汪", "泉山", "铜山", "丰县", "沛县", "睢宁", "新沂", "邳州"]
    }, {
      "name": "常州",
      "area": ["天宁", "钟楼", "新北", "武进", "金坛", "溧阳"]
    }, {
      "name": "苏州",
      "area": ["虎丘", "吴中", "相城", "姑苏", "吴江", "常熟", "张家港", "昆山", "太仓"]
    }, {
      "name": "南通",
      "area": ["崇川", "港闸", "通州", "如东", "启东", "如皋", "海门", "海安"]
    }, {
      "name": "连云港",
      "area": ["连云", "海州", "赣榆", "东海", "灌云", "灌南"]
    }, {
      "name": "淮安",
      "area": ["淮安", "淮阴", "清江浦", "洪泽", "涟水", "盱眙", "金湖"]
    }, {
      "name": "盐城",
      "area": ["亭湖", "盐都", "大丰", "响水", "滨海", "阜宁", "射阳", "建湖", "东台"]
    }, {
      "name": "扬州",
      "area": ["广陵", "邗江", "江都", "宝应", "仪征", "高邮"]
    }, {
      "name": "镇江",
      "area": ["京口", "润州", "丹徒", "丹阳", "扬中", "句容"]
    }, {
      "name": "泰州",
      "area": ["海陵", "高港", "姜堰", "兴化", "靖江", "泰兴"]
    }, {
      "name": "宿迁",
      "area": ["宿城", "宿豫", "沭阳", "泗阳", "泗洪"]
    }]
  }, {
    "name": "浙江",
    "city": [{
      "name": "杭州",
      "area": ["上城", "下城", "江干", "拱墅", "西湖", "滨江", "萧山", "余杭", "富阳", "临安", "桐庐", "淳安", "建德"]
    }, {
      "name": "宁波",
      "area": ["海曙", "江北", "北仑", "镇海", "鄞州", "奉化", "象山", "宁海", "余姚", "慈溪"]
    }, {
      "name": "温州",
      "area": ["鹿城", "龙湾", "瓯海", "洞头", "永嘉", "平阳", "苍南", "文成", "泰顺", "瑞安", "乐清"]
    }, {
      "name": "嘉兴",
      "area": ["南湖", "秀洲", "嘉善", "海盐", "海宁", "平湖", "桐乡"]
    }, {
      "name": "湖州",
      "area": ["吴兴", "南浔", "德清", "长兴", "安吉"]
    }, {
      "name": "绍兴",
      "area": ["越城", "柯桥", "上虞", "新昌", "诸暨", "嵊州"]
    }, {
      "name": "金华",
      "area": ["婺城", "金东", "武义", "浦江", "磐安", "兰溪", "义乌", "东阳", "永康"]
    }, {
      "name": "衢州",
      "area": ["柯城", "衢江", "常山", "开化", "龙游", "江山"]
    }, {
      "name": "舟山",
      "area": ["定海", "普陀", "岱山", "嵊泗"]
    }, {
      "name": "台州",
      "area": ["椒江", "黄岩", "路桥", "三门", "天台", "仙居", "温岭", "临海", "玉环"]
    }, {
      "name": "丽水",
      "area": ["莲都", "青田", "缙云", "遂昌", "松阳", "云和", "庆元", "景宁", "龙泉"]
    }]
  }, {
    "name": "安徽",
    "city": [{
      "name": "合肥",
      "area": ["瑶海", "庐阳", "蜀山", "包河", "长丰", "肥东", "肥西", "庐江", "巢湖"]
    }, {
      "name": "芜湖",
      "area": ["镜湖", "弋江", "鸠江", "三山", "芜湖", "繁昌", "南陵", "无为"]
    }, {
      "name": "蚌埠",
      "area": ["龙子湖", "蚌山", "禹会", "淮上", "怀远", "五河", "固镇"]
    }, {
      "name": "淮南",
      "area": ["大通", "田家庵", "谢家集", "八公山", "潘集", "凤台", "寿县"]
    }, {
      "name": "马鞍山",
      "area": ["花山", "雨山", "博望", "当涂", "含山", "和县"]
    }, {
      "name": "淮北",
      "area": ["杜集", "相山", "烈山", "濉溪"]
    }, {
      "name": "铜陵",
      "area": ["铜官", "义安", "郊区", "枞阳"]
    }, {
      "name": "安庆",
      "area": ["迎江", "大观", "宜秀", "怀宁", "太湖", "宿松", "望江", "岳西", "桐城", "潜山"]
    }, {
      "name": "黄山",
      "area": ["屯溪", "黄山", "徽州", "歙县", "休宁", "黟县", "祁门"]
    }, {
      "name": "滁州",
      "area": ["琅琊", "南谯", "来安", "全椒", "定远", "凤阳", "天长", "明光"]
    }, {
      "name": "阜阳",
      "area": ["颍州", "颍东", "颍泉", "临泉", "太和", "阜南", "颍上", "界首"]
    }, {
      "name": "宿州",
      "area": ["埇桥", "砀山", "萧县", "灵璧", "泗县"]
    }, {
      "name": "六安",
      "area": ["金安", "裕安", "叶集", "霍邱", "舒城", "金寨", "霍山"]
    }, {
      "name": "亳州",
      "area": ["谯城", "涡阳", "蒙城", "利辛"]
    }, {
      "name": "池州",
      "area": ["贵池", "东至", "石台", "青阳"]
    }, {
      "name": "宣城",
      "area": ["宣州", "郎溪", "广德", "泾县", "绩溪", "旌德", "宁国"]
    }]
  }, {
    "name": "福建",
    "city": [{
      "name": "福州",
      "area": ["鼓楼", "台江", "仓山", "马尾", "晋安", "长乐", "闽侯", "连江", "罗源", "闽清", "永泰", "平潭", "福清"]
    }, {
      "name": "厦门",
      "area": ["思明", "海沧", "湖里", "集美", "同安", "翔安"]
    }, {
      "name": "莆田",
      "area": ["城厢", "涵江", "荔城", "秀屿", "仙游"]
    }, {
      "name": "三明",
      "area": ["梅列", "三元", "明溪", "清流", "宁化", "大田", "尤溪", "沙县", "将乐", "泰宁", "建宁", "永安"]
    }, {
      "name": "泉州",
      "area": ["鲤城", "丰泽", "洛江", "泉港", "惠安", "安溪", "永春", "德化", "金门", "石狮", "晋江", "南安"]
    }, {
      "name": "漳州",
      "area": ["芗城", "龙文", "云霄", "漳浦", "诏安", "长泰", "东山", "南靖", "平和", "华安", "龙海"]
    }, {
      "name": "南平",
      "area": ["延平", "建阳", "顺昌", "浦城", "光泽", "松溪", "政和", "邵武", "武夷山", "建瓯"]
    }, {
      "name": "龙岩",
      "area": ["新罗", "永定", "长汀", "上杭", "武平", "连城", "漳平"]
    }, {
      "name": "宁德",
      "area": ["蕉城", "霞浦", "古田", "屏南", "寿宁", "周宁", "柘荣", "福安", "福鼎"]
    }]
  }, {
    "name": "江西",
    "city": [{
      "name": "南昌",
      "area": ["东湖", "西湖", "青云谱", "湾里", "青山湖", "新建", "南昌", "安义", "进贤"]
    }, {
      "name": "景德镇",
      "area": ["昌江", "珠山", "浮梁", "乐平"]
    }, {
      "name": "萍乡",
      "area": ["安源", "湘东", "莲花", "上栗", "芦溪"]
    }, {
      "name": "九江",
      "area": ["濂溪", "浔阳", "柴桑", "武宁", "修水", "永修", "德安", "都昌", "湖口", "彭泽", "瑞昌", "共青城", "庐山"]
    }, {
      "name": "新余",
      "area": ["渝水", "分宜"]
    }, {
      "name": "鹰潭",
      "area": ["月湖", "余江", "贵溪"]
    }, {
      "name": "赣州",
      "area": ["章贡", "南康", "赣县", "信丰", "大余", "上犹", "崇义", "安远", "龙南", "定南", "全南", "宁都", "于都", "兴国", "会昌", "寻乌", "石城", "瑞金"]
    }, {
      "name": "吉安",
      "area": ["吉州", "青原", "吉安", "吉水", "峡江", "新干", "永丰", "泰和", "遂川", "万安", "安福", "永新", "井冈山"]
    }, {
      "name": "宜春",
      "area": ["袁州", "奉新", "万载", "上高", "宜丰", "靖安", "铜鼓", "丰城", "樟树", "高安"]
    }, {
      "name": "抚州",
      "area": ["临川", "东乡", "南城", "黎川", "南丰", "崇仁", "乐安", "宜黄", "金溪", "资溪", "广昌"]
    }, {
      "name": "上饶",
      "area": ["信州", "广丰", "上饶", "玉山", "铅山", "横峰", "弋阳", "余干", "鄱阳", "万年", "婺源", "德兴"]
    }]
  }, {
    "name": "山东",
    "city": [{
      "name": "济南",
      "area": ["历下", "槐荫", "天桥", "历城", "长清", "章丘", "平阴", "济阳", "商河", "市中"]
    }, {
      "name": "青岛",
      "area": ["市南", "市北", "黄岛", "崂山", "李沧", "城阳", "即墨", "胶州", "平度", "莱西"]
    }, {
      "name": "淄博",
      "area": ["淄川", "张店", "博山", "临淄", "周村", "桓台", "高青", "沂源"]
    }, {
      "name": "枣庄",
      "area": ["薛城", "峄城", "台儿庄", "山亭", "滕州", "市中"]
    }, {
      "name": "东营",
      "area": ["东营", "河口", "垦利", "利津", "广饶"]
    }, {
      "name": "烟台",
      "area": ["芝罘", "福山", "牟平", "莱山", "长岛", "龙口", "莱阳", "莱州", "蓬莱", "招远", "栖霞", "海阳"]
    }, {
      "name": "潍坊",
      "area": ["潍城", "寒亭", "坊子", "奎文", "临朐", "昌乐", "青州", "诸城", "寿光", "安丘", "高密", "昌邑"]
    }, {
      "name": "济宁",
      "area": ["任城", "兖州", "微山", "鱼台", "金乡", "嘉祥", "汶上", "泗水", "梁山", "曲阜", "邹城"]
    }, {
      "name": "泰安",
      "area": ["泰山", "岱岳", "宁阳", "东平", "新泰", "肥城"]
    }, {
      "name": "威海",
      "area": ["环翠", "文登", "荣成", "乳山"]
    }, {
      "name": "日照",
      "area": ["东港", "岚山", "五莲", "莒县"]
    }, {
      "name": "莱芜",
      "area": ["莱城", "钢城"]
    }, {
      "name": "临沂",
      "area": ["兰山", "罗庄", "河东", "沂南", "郯城", "沂水", "兰陵", "费县", "平邑", "莒南", "蒙阴", "临沭"]
    }, {
      "name": "德州",
      "area": ["德城", "陵城", "宁津", "庆云", "临邑", "齐河", "平原", "夏津", "武城", "乐陵", "禹城"]
    }, {
      "name": "聊城",
      "area": ["东昌府", "阳谷", "莘县", "茌平", "东阿", "冠县", "高唐", "临清"]
    }, {
      "name": "滨州",
      "area": ["滨城", "沾化", "惠民", "阳信", "无棣", "博兴", "邹平"]
    }, {
      "name": "菏泽",
      "area": ["牡丹", "定陶", "曹县", "单县", "成武", "巨野", "郓城", "鄄城", "东明"]
    }]
  }, {
    "name": "河南",
    "city": [{
      "name": "郑州",
      "area": ["中原", "二七", "管城", "金水", "上街", "惠济", "中牟", "巩义", "荥阳", "新密", "新郑", "登封"]
    }, {
      "name": "开封",
      "area": ["龙亭", "顺河", "鼓楼", "禹王台", "祥符", "杞县", "通许", "尉氏", "兰考"]
    }, {
      "name": "洛阳",
      "area": ["老城", "西工", "瀍河", "涧西", "吉利", "洛龙", "孟津", "新安", "栾川", "嵩县", "汝阳", "宜阳", "洛宁", "伊川", "偃师"]
    }, {
      "name": "平顶山",
      "area": ["新华", "卫东", "石龙", "湛河", "宝丰", "叶县", "鲁山", "郏县", "舞钢", "汝州"]
    }, {
      "name": "安阳",
      "area": ["文峰", "北关", "殷都", "龙安", "安阳", "汤阴", "滑县", "内黄", "林州"]
    }, {
      "name": "鹤壁",
      "area": ["鹤山", "山城", "淇滨", "浚县", "淇县"]
    }, {
      "name": "新乡",
      "area": ["红旗", "卫滨", "凤泉", "牧野", "新乡", "获嘉", "原阳", "延津", "封丘", "长垣", "卫辉", "辉县"]
    }, {
      "name": "焦作",
      "area": ["解放", "中站", "马村", "山阳", "修武", "博爱", "武陟", "温县", "沁阳", "孟州"]
    }, {
      "name": "濮阳",
      "area": ["华龙", "清丰", "南乐", "范县", "台前", "濮阳"]
    }, {
      "name": "许昌",
      "area": ["魏都", "建安", "鄢陵", "襄城", "禹州", "长葛"]
    }, {
      "name": "漯河",
      "area": ["源汇", "郾城", "召陵", "舞阳", "临颍"]
    }, {
      "name": "三门峡",
      "area": ["湖滨", "陕州", "渑池", "卢氏", "义马", "灵宝"]
    }, {
      "name": "南阳",
      "area": ["宛城", "卧龙", "南召", "方城", "西峡", "镇平", "内乡", "淅川", "社旗", "唐河", "新野", "桐柏", "邓州"]
    }, {
      "name": "商丘",
      "area": ["梁园", "睢阳", "民权", "睢县", "宁陵", "柘城", "虞城", "夏邑", "永城"]
    }, {
      "name": "信阳",
      "area": ["浉河", "平桥", "罗山", "光山", "新县", "商城", "固始", "潢川", "淮滨", "息县"]
    }, {
      "name": "周口",
      "area": ["川汇", "扶沟", "西华", "商水", "沈丘", "郸城", "淮阳", "太康", "鹿邑", "项城"]
    }, {
      "name": "驻马店",
      "area": ["驿城", "西平", "上蔡", "平舆", "正阳", "确山", "泌阳", "汝南", "遂平", "新蔡"]
    }, {
      "name": "济源",
      "area": []
    }]
  }, {
    "name": "湖北",
    "city": [{
      "name": "武汉",
      "area": ["江岸", "江汉", "硚口", "汉阳", "武昌", "青山", "洪山", "东西湖", "汉南", "蔡甸", "江夏", "黄陂", "新洲"]
    }, {
      "name": "黄石",
      "area": ["黄石港", "西塞山", "下陆", "铁山", "阳新", "大冶"]
    }, {
      "name": "十堰",
      "area": ["茅箭", "张湾", "郧阳", "郧西", "竹山", "竹溪", "房县", "丹江口"]
    }, {
      "name": "宜昌",
      "area": ["西陵", "伍家岗", "点军", "猇亭", "夷陵", "远安", "兴山", "秭归", "长阳土", "五峰土", "宜都", "当阳", "枝江"]
    }, {
      "name": "襄阳",
      "area": ["襄城", "樊城", "襄州", "南漳", "谷城", "保康", "老河口", "枣阳", "宜城"]
    }, {
      "name": "鄂州",
      "area": ["梁子湖", "华容", "鄂城"]
    }, {
      "name": "荆门",
      "area": ["东宝", "掇刀", "京山", "沙洋", "钟祥"]
    }, {
      "name": "孝感",
      "area": ["孝南", "孝昌", "大悟", "云梦", "应城", "安陆", "汉川"]
    }, {
      "name": "荆州",
      "area": ["沙市", "荆州", "公安", "监利", "江陵", "石首", "洪湖", "松滋"]
    }, {
      "name": "黄冈",
      "area": ["黄州", "团风", "红安", "罗田", "英山", "浠水", "蕲春", "黄梅", "麻城", "武穴"]
    }, {
      "name": "咸宁",
      "area": ["咸安", "嘉鱼", "通城", "崇阳", "通山", "赤壁"]
    }, {
      "name": "随州",
      "area": ["曾都", "随县", "广水"]
    }, {
      "name": "恩施",
      "area": ["恩施", "利川", "建始", "巴东", "宣恩", "咸丰", "来凤", "鹤峰"]
    }, {
      "name": "仙桃",
      "area": []
    }, {
      "name": "潜江",
      "area": []
    }, {
      "name": "神农架林区",
      "area": []
    }, {
      "name": "天门",
      "area": []
    }]
  }, {
    "name": "湖南",
    "city": [{
      "name": "长沙",
      "area": ["芙蓉", "天心", "岳麓", "开福", "雨花", "望城", "长沙", "浏阳", "宁乡"]
    }, {
      "name": "株洲",
      "area": ["荷塘", "芦淞", "石峰", "天元", "株洲", "攸县", "茶陵", "炎陵", "醴陵", "渌口区"]
    }, {
      "name": "湘潭",
      "area": ["雨湖", "岳塘", "湘潭", "湘乡", "韶山"]
    }, {
      "name": "衡阳",
      "area": ["珠晖", "雁峰", "石鼓", "蒸湘", "南岳", "衡阳", "衡南", "衡山", "衡东", "祁东", "耒阳", "常宁"]
    }, {
      "name": "邵阳",
      "area": ["双清", "大祥", "北塔", "邵东", "新邵", "邵阳", "隆回", "洞口", "绥宁", "新宁", "城步", "武冈"]
    }, {
      "name": "岳阳",
      "area": ["岳阳楼", "云溪", "君山", "岳阳", "华容", "湘阴", "平江", "汨罗", "临湘"]
    }, {
      "name": "常德",
      "area": ["武陵", "鼎城", "安乡", "汉寿", "澧县", "临澧", "桃源", "石门", "津"]
    }, {
      "name": "张家界",
      "area": ["永定", "武陵源", "慈利", "桑植"]
    }, {
      "name": "益阳",
      "area": ["资阳", "赫山", "南县", "桃江", "安化", "沅江"]
    }, {
      "name": "郴州",
      "area": ["北湖", "苏仙", "桂阳", "宜章", "永兴", "嘉禾", "临武", "汝城", "桂东", "安仁", "资兴"]
    }, {
      "name": "永州",
      "area": ["零陵", "冷水滩", "祁阳", "东安", "双牌", "道县", "江永", "宁远", "蓝山", "新田", "江华"]
    }, {
      "name": "怀化",
      "area": ["鹤城", "中方", "沅陵", "辰溪", "溆浦", "会同", "麻阳", "新晃", "芷江", "靖州", "通道", "洪江"]
    }, {
      "name": "娄底",
      "area": ["娄星", "双峰", "新化", "冷水江", "涟源"]
    }, {
      "name": "湘西",
      "area": ["吉首", "泸溪", "凤凰", "花垣", "保靖", "古丈", "永顺", "龙山"]
    }]
  }, {
    "name": "广东",
    "city": [{
      "name": "广州",
      "area": ["荔湾", "越秀", "海珠", "天河", "白云", "黄埔", "番禺", "花都", "南沙", "从化", "增城"]
    }, {
      "name": "韶关",
      "area": ["武江", "浈江", "曲江", "始兴", "仁化", "翁源", "乳源", "新丰", "乐昌", "南雄"]
    }, {
      "name": "深圳",
      "area": ["罗湖", "福田", "南山", "宝安", "龙岗", "盐田", "龙华", "坪山", "光明"]
    }, {
      "name": "珠海",
      "area": ["香洲", "斗门", "金湾"]
    }, {
      "name": "汕头",
      "area": ["龙湖", "金平", "濠江", "潮阳", "潮南", "澄海", "南澳"]
    }, {
      "name": "佛山",
      "area": ["禅城", "南海", "顺德", "三水", "高明"]
    }, {
      "name": "江门",
      "area": ["蓬江", "江海", "新会", "台山", "开平", "鹤山", "恩平"]
    }, {
      "name": "湛江",
      "area": ["赤坎", "霞山", "坡头", "麻章", "遂溪", "徐闻", "廉江", "雷州", "吴川"]
    }, {
      "name": "茂名",
      "area": ["茂南", "电白", "高州", "化州", "信宜"]
    }, {
      "name": "肇庆",
      "area": ["端州", "鼎湖", "高要", "广宁", "怀集", "封开", "德庆", "四会"]
    }, {
      "name": "惠州",
      "area": ["惠城", "惠阳", "博罗", "惠东", "龙门"]
    }, {
      "name": "梅州",
      "area": ["梅江", "梅县", "大埔", "丰顺", "五华", "平远", "蕉岭", "兴宁"]
    }, {
      "name": "汕尾",
      "area": ["城区", "海丰", "陆河", "陆丰"]
    }, {
      "name": "河源",
      "area": ["源城", "紫金", "龙川", "连平", "和平", "东源"]
    }, {
      "name": "阳江",
      "area": ["江城", "阳东", "阳西", "阳春"]
    }, {
      "name": "清远",
      "area": ["清城", "清新", "佛冈", "阳山", "连山", "连南", "英德", "连州"]
    }, {
      "name": "潮州",
      "area": ["湘桥", "潮安", "饶平"]
    }, {
      "name": "揭阳",
      "area": ["榕城", "揭东", "揭西", "惠来", "普宁"]
    }, {
      "name": "云浮",
      "area": ["云城", "云安", "新兴", "郁南", "罗定"]
    }, {
      "name": "东莞",
      "area": []
    }, {
      "name": "中山",
      "area": []
    }]
  }, {
    "name": "广西",
    "city": [{
      "name": "南宁",
      "area": ["兴宁", "青秀", "江南", "西乡塘", "良庆", "邕宁", "武鸣", "隆安", "马山", "上林", "宾阳", "横县"]
    }, {
      "name": "柳州",
      "area": ["城中", "鱼峰", "柳南", "柳北", "柳江", "柳城", "鹿寨", "融安", "融水", "三江"]
    }, {
      "name": "桂林",
      "area": ["秀峰", "叠彩", "象山", "七星", "雁山", "临桂", "阳朔", "灵川", "全州", "兴安", "永福", "灌阳", "龙胜", "资源", "平乐", "荔浦", "恭城"]
    }, {
      "name": "梧州",
      "area": ["万秀", "长洲", "龙圩", "苍梧", "藤县", "蒙山", "岑溪"]
    }, {
      "name": "北海",
      "area": ["海城", "银海", "铁山港", "合浦"]
    }, {
      "name": "防城港",
      "area": ["港口", "防城", "上思", "东兴"]
    }, {
      "name": "钦州",
      "area": ["钦南", "钦北", "灵山", "浦北"]
    }, {
      "name": "贵港",
      "area": ["港北", "港南", "覃塘", "平南", "桂平"]
    }, {
      "name": "玉林",
      "area": ["玉州", "福绵", "容县", "陆川", "博白", "兴业", "北流"]
    }, {
      "name": "百色",
      "area": ["右江", "田阳", "田东", "平果", "德保", "那坡", "凌云", "乐业", "田林", "西林", "隆林", "靖西"]
    }, {
      "name": "贺州",
      "area": ["八步", "平桂", "昭平", "钟山", "富川"]
    }, {
      "name": "河池",
      "area": ["金城江", "宜州", "南丹", "天峨", "凤山", "东兰", "罗城", "环江", "巴马", "都安", "大化"]
    }, {
      "name": "来宾",
      "area": ["兴宾", "忻城", "象州", "武宣", "金秀", "合山"]
    }, {
      "name": "崇左",
      "area": ["江州", "扶绥", "宁明", "龙州", "大新", "天等", "凭祥"]
    }]
  }, {
    "name": "海南",
    "city": [{
      "name": "海口",
      "area": ["秀英", "龙华", "琼山", "美兰"]
    }, {
      "name": "三亚",
      "area": ["海棠", "吉阳", "天涯", "崖州"]
    }, {
      "name": "三沙",
      "area": []
    }, {
      "name": "儋州",
      "area": []
    }, {
      "name": "五指山",
      "area": []
    }, {
      "name": "琼海",
      "area": []
    }, {
      "name": "文昌",
      "area": []
    }, {
      "name": "万宁",
      "area": []
    }, {
      "name": "东方",
      "area": []
    }, {
      "name": "定安",
      "area": []
    }, {
      "name": "屯昌",
      "area": []
    }, {
      "name": "澄迈",
      "area": []
    }, {
      "name": "临高",
      "area": []
    }, {
      "name": "白沙",
      "area": []
    }, {
      "name": "昌江",
      "area": []
    }, {
      "name": "乐东",
      "area": []
    }, {
      "name": "陵水",
      "area": []
    }, {
      "name": "保亭",
      "area": []
    }, {
      "name": "琼中",
      "area": []
    }]
  }, {
    "name": "四川",
    "city": [{
      "name": "成都",
      "area": ["锦江", "青羊", "金牛", "武侯", "成华", "龙泉驿", "青白江", "新都", "温江", "双流", "郫都", "金堂", "大邑", "蒲江", "新津", "都江堰", "彭州", "邛崃", "崇州", "简阳"]
    }, {
      "name": "自贡",
      "area": ["自流井", "贡井", "大安", "沿滩", "荣县", "富顺"]
    }, {
      "name": "攀枝花",
      "area": ["东区", "西区", "仁和", "米易", "盐边"]
    }, {
      "name": "泸州",
      "area": ["江阳", "纳溪", "龙马潭", "泸县", "合江", "叙永", "古蔺"]
    }, {
      "name": "德阳",
      "area": ["旌阳", "罗江", "中江", "广汉", "什邡", "绵竹"]
    }, {
      "name": "绵阳",
      "area": ["涪城", "游仙", "安州", "三台", "盐亭", "梓潼", "北川", "平武", "江油"]
    }, {
      "name": "广元",
      "area": ["利州", "昭化", "朝天", "旺苍", "青川", "剑阁", "苍溪"]
    }, {
      "name": "遂宁",
      "area": ["船山", "安居", "蓬溪", "射洪", "大英"]
    }, {
      "name": "内江",
      "area": ["东兴", "威远", "资中", "隆昌", "市中"]
    }, {
      "name": "乐山",
      "area": ["沙湾", "五通桥", "金口河", "犍为", "井研", "夹江", "沐川", "峨边", "马边", "峨眉山", "市中"]
    }, {
      "name": "南充",
      "area": ["顺庆", "高坪", "嘉陵", "南部", "营山", "蓬安", "仪陇", "西充", "阆中"]
    }, {
      "name": "眉山",
      "area": ["东坡", "彭山", "仁寿", "洪雅", "丹棱", "青神"]
    }, {
      "name": "宜宾",
      "area": ["翠屏", "南溪", "叙州", "宜宾", "江安", "长宁", "高县", "珙县", "筠连", "兴文", "屏山"]
    }, {
      "name": "广安",
      "area": ["广安", "前锋", "岳池", "武胜", "邻水", "华蓥"]
    }, {
      "name": "达州",
      "area": ["通川", "达川", "宣汉", "开江", "大竹", "渠县", "万源"]
    }, {
      "name": "雅安",
      "area": ["雨城", "名山", "荥经", "汉源", "石棉", "天全", "芦山", "宝兴"]
    }, {
      "name": "巴中",
      "area": ["巴州", "恩阳", "通江", "南江", "平昌"]
    }, {
      "name": "资阳",
      "area": ["雁江", "安岳", "乐至"]
    }, {
      "name": "阿坝",
      "area": ["马尔康", "汶川", "理县", "茂县", "松潘", "九寨沟", "金川", "小金", "黑水", "壤塘", "阿坝", "若尔盖", "红原"]
    }, {
      "name": "甘孜",
      "area": ["康定", "泸定", "丹巴", "九龙", "雅江", "道孚", "炉霍", "甘孜", "新龙", "德格", "白玉", "石渠", "色达", "理塘", "巴塘", "乡城", "稻城", "得荣"]
    }, {
      "name": "凉山",
      "area": ["西昌", "木里", "盐源", "德昌", "会理", "会东", "宁南", "普格", "布拖", "金阳", "昭觉", "喜德", "冕宁", "越西", "甘洛", "美姑", "雷波"]
    }]
  }, {
    "name": "贵州",
    "city": [{
      "name": "贵阳",
      "area": ["南明", "云岩", "花溪", "乌当", "白云", "观山湖", "开阳", "息烽", "修文", "清镇"]
    }, {
      "name": "六盘水",
      "area": ["钟山", "六枝特", "水城", "盘州"]
    }, {
      "name": "遵义",
      "area": ["红花岗", "汇川", "播州", "桐梓", "绥阳", "正安", "道真", "务川", "凤冈", "湄潭", "余庆", "习水", "赤水", "仁怀"]
    }, {
      "name": "安顺",
      "area": ["西秀", "平坝", "普定", "镇宁", "关岭布", "紫云"]
    }, {
      "name": "毕节",
      "area": ["七星关", "大方", "黔西", "金沙", "织金", "纳雍", "威宁", "赫章"]
    }, {
      "name": "铜仁",
      "area": ["碧江", "万山", "江口", "玉屏", "石阡", "思南", "印江", "德江", "沿河", "松桃"]
    }, {
      "name": "黔西",
      "area": ["兴义", "兴仁", "普安", "晴隆", "贞丰", "望谟", "册亨", "安龙"]
    }, {
      "name": "黔东",
      "area": ["凯里", "黄平", "施秉", "三穗", "镇远", "岑巩", "天柱", "锦屏", "剑河", "台江", "黎平", "榕江", "从江", "雷山", "麻江", "丹寨"]
    }, {
      "name": "黔南",
      "area": ["都匀", "福泉", "荔波", "贵定", "瓮安", "独山", "平塘", "罗甸", "长顺", "龙里", "惠水", "三都"]
    }]
  }, {
    "name": "云南",
    "city": [{
      "name": "昆明",
      "area": ["五华", "盘龙", "官渡", "西山", "东川", "呈贡", "晋宁", "富民", "宜良", "石林", "嵩明", "禄劝", "寻甸", "安宁"]
    }, {
      "name": "曲靖",
      "area": ["麒麟", "沾益", "马龙", "陆良", "师宗", "罗平", "富源", "会泽", "宣威"]
    }, {
      "name": "玉溪",
      "area": ["红塔", "江川", "澄江", "通海", "华宁", "易门", "峨山", "新平", "元江"]
    }, {
      "name": "保山",
      "area": ["隆阳", "施甸", "龙陵", "昌宁", "腾冲"]
    }, {
      "name": "昭通",
      "area": ["昭阳", "鲁甸", "巧家", "盐津", "大关", "永善", "绥江", "镇雄", "彝良", "威信", "水富"]
    }, {
      "name": "丽江",
      "area": ["古城", "玉龙", "永胜", "华坪", "宁蒗"]
    }, {
      "name": "普洱",
      "area": ["思茅", "宁洱", "墨江", "景东", "景谷", "镇沅", "江城", "孟连", "澜沧", "西盟"]
    }, {
      "name": "临沧",
      "area": ["临翔", "凤庆", "云县", "永德", "镇康", "双江", "耿马", "沧源"]
    }, {
      "name": "楚雄",
      "area": ["楚雄", "双柏", "牟定", "南华", "姚安", "大姚", "永仁", "元谋", "武定", "禄丰"]
    }, {
      "name": "红河",
      "area": ["个旧", "开远", "蒙自", "弥勒", "屏边", "建水", "石屏", "泸西", "元阳", "红河", "金平", "绿春", "河口"]
    }, {
      "name": "文山",
      "area": ["文山", "砚山", "西畴", "麻栗坡", "马关", "丘北", "广南", "富宁"]
    }, {
      "name": "西双版纳",
      "area": ["景洪", "勐海", "勐腊"]
    }, {
      "name": "大理",
      "area": ["大理", "漾濞", "祥云", "宾川", "弥渡", "南涧", "巍山", "永平", "云龙", "洱源", "剑川", "鹤庆"]
    }, {
      "name": "德宏",
      "area": ["瑞丽", "芒市", "梁河", "盈江", "陇川"]
    }, {
      "name": "怒江",
      "area": ["泸水", "福贡", "贡山", "兰坪"]
    }, {
      "name": "迪庆",
      "area": ["香格里拉", "德钦", "维西"]
    }]
  }, {
    "name": "西藏",
    "city": [{
      "name": "拉萨",
      "area": ["城关", "堆龙德庆", "达孜", "林周", "当雄", "尼木", "曲水", "墨竹工卡"]
    }, {
      "name": "日喀则",
      "area": ["桑珠孜", "南木林", "江孜", "定日", "萨迦", "拉孜", "昂仁", "谢通门", "白朗", "仁布", "康马", "定结", "仲巴", "亚东", "吉隆", "聂拉木", "萨嘎", "岗巴"]
    }, {
      "name": "昌都",
      "area": ["卡若", "江达", "贡觉", "类乌齐", "丁青", "察雅", "八宿", "左贡", "芒康", "洛隆", "边坝"]
    }, {
      "name": "林芝",
      "area": ["巴宜", "工布江达", "米林", "墨脱", "波密", "察隅", "朗县"]
    }, {
      "name": "山南",
      "area": ["乃东", "扎囊", "贡嘎", "桑日", "琼结", "曲松", "措美", "洛扎", "加查", "隆子", "错那", "浪卡子"]
    }, {
      "name": "那曲",
      "area": ["色尼", "嘉黎", "比如", "聂荣", "安多", "申扎", "索县", "班戈", "巴青", "尼玛", "双湖"]
    }, {
      "name": "阿里",
      "area": ["普兰", "札达", "噶尔", "日土", "革吉", "改则", "措勤"]
    }]
  }, {
    "name": "陕西",
    "city": [{
      "name": "西安",
      "area": ["新城", "碑林", "莲湖", "灞桥", "未央", "雁塔", "阎良", "临潼", "长安", "高陵", "鄠邑", "蓝田", "周至"]
    }, {
      "name": "铜川",
      "area": ["王益", "印台", "耀州", "宜君"]
    }, {
      "name": "宝鸡",
      "area": ["渭滨", "金台", "陈仓", "凤翔", "岐山", "扶风", "眉县", "陇县", "千阳", "麟游", "凤县", "太白"]
    }, {
      "name": "咸阳",
      "area": ["秦都", "杨陵", "渭城", "三原", "泾阳", "乾县", "礼泉", "永寿", "长武", "旬邑", "淳化", "武功", "兴平", "彬州"]
    }, {
      "name": "渭南",
      "area": ["临渭", "华州", "潼关", "大荔", "合阳", "澄城", "蒲城", "白水", "富平", "韩城", "华阴"]
    }, {
      "name": "延安",
      "area": ["宝塔", "安塞", "延长", "延川", "子长", "志丹", "吴起", "甘泉", "富县", "洛川", "宜川", "黄龙", "黄陵"]
    }, {
      "name": "汉中",
      "area": ["汉台", "南郑", "城固", "洋县", "西乡", "勉县", "宁强", "略阳", "镇巴", "留坝", "佛坪"]
    }, {
      "name": "榆林",
      "area": ["榆阳", "横山", "府谷", "靖边", "定边", "绥德", "米脂", "佳县", "吴堡", "清涧", "子洲", "神木"]
    }, {
      "name": "安康",
      "area": ["汉滨", "汉阴", "石泉", "宁陕", "紫阳", "岚皋", "平利", "镇坪", "旬阳", "白河"]
    }, {
      "name": "商洛",
      "area": ["商州", "洛南", "丹凤", "商南", "山阳", "镇安", "柞水"]
    }]
  }, {
    "name": "甘肃",
    "city": [{
      "name": "兰州",
      "area": ["城关", "七里河", "西固", "安宁", "红古", "永登", "皋兰", "榆中"]
    }, {
      "name": "金昌",
      "area": ["金川", "永昌"]
    }, {
      "name": "白银",
      "area": ["白银", "平川", "靖远", "会宁", "景泰"]
    }, {
      "name": "天水",
      "area": ["秦州", "麦积", "清水", "秦安", "甘谷", "武山", "张家川"]
    }, {
      "name": "武威",
      "area": ["凉州", "民勤", "古浪", "天祝"]
    }, {
      "name": "张掖",
      "area": ["甘州", "肃南", "民乐", "临泽", "高台", "山丹"]
    }, {
      "name": "平凉",
      "area": ["崆峒", "泾川", "灵台", "崇信", "华亭", "庄浪", "静宁"]
    }, {
      "name": "酒泉",
      "area": ["肃州", "金塔", "瓜州", "肃北", "阿克塞", "玉门", "敦煌"]
    }, {
      "name": "庆阳",
      "area": ["西峰", "庆城", "环县", "华池", "合水", "正宁", "宁县", "镇原"]
    }, {
      "name": "定西",
      "area": ["安定", "通渭", "陇西", "渭源", "临洮", "漳县", "岷县"]
    }, {
      "name": "陇南",
      "area": ["武都", "成县", "文县", "宕昌", "康县", "西和", "礼县", "徽县", "两当"]
    }, {
      "name": "临夏",
      "area": ["临夏", "临夏", "康乐", "永靖", "广河", "和政", "东乡族", "积石山"]
    }, {
      "name": "甘南",
      "area": ["合作", "临潭", "卓尼", "舟曲", "迭部", "玛曲", "碌曲", "夏河"]
    }, {
      "name": "嘉峪关",
      "area": []
    }]
  }, {
    "name": "青海",
    "city": [{
      "name": "西宁",
      "area": ["城东", "城中", "城西", "城北", "大通", "湟中", "湟源"]
    }, {
      "name": "海东",
      "area": ["乐都", "平安", "民和", "互助", "化隆", "循化"]
    }, {
      "name": "甘南",
      "area": ["门源", "祁连", "海晏", "刚察"]
    }, {
      "name": "黄南",
      "area": ["同仁", "尖扎", "泽库", "河南"]
    }, {
      "name": "海南",
      "area": ["共和", "同德", "贵德", "兴海", "贵南"]
    }, {
      "name": "果洛",
      "area": ["玛沁", "班玛", "甘德", "达日", "久治", "玛多"]
    }, {
      "name": "玉树",
      "area": ["玉树", "杂多", "称多", "治多", "囊谦", "曲麻莱"]
    }, {
      "name": "海西",
      "area": ["格尔木", "德令哈", "茫崖", "乌兰", "都兰", "天峻"]
    }, {
      "name": "海北",
      "area": []
    }]
  }, {
    "name": "宁夏",
    "city": [{
      "name": "银川",
      "area": ["兴庆", "西夏", "金凤", "永宁", "贺兰", "灵武"]
    }, {
      "name": "石嘴山",
      "area": ["大武口", "惠农", "平罗"]
    }, {
      "name": "吴忠",
      "area": ["利通", "红寺堡", "盐池", "同心", "青铜峡"]
    }, {
      "name": "固原",
      "area": ["原州", "西吉", "隆德", "泾源", "彭阳"]
    }, {
      "name": "中卫",
      "area": ["沙坡头", "中宁", "海原"]
    }]
  }, {
    "name": "新疆",
    "city": [{
      "name": "乌鲁木齐",
      "area": ["天山", "沙依巴克", "新市", "水磨沟", "头屯河", "达坂城", "米东", "乌鲁木齐"]
    }, {
      "name": "克拉玛依",
      "area": ["独山子", "克拉玛依", "白碱滩", "乌尔禾"]
    }, {
      "name": "吐鲁番",
      "area": ["高昌", "鄯善", "托克逊"]
    }, {
      "name": "哈密",
      "area": ["伊州", "巴里坤", "伊吾"]
    }, {
      "name": "昌吉",
      "area": ["昌吉", "阜康", "呼图壁", "玛纳斯", "奇台", "吉木萨尔", "木垒哈萨克"]
    }, {
      "name": "博尔塔拉",
      "area": ["博乐", "阿拉山口", "精河", "温泉"]
    }, {
      "name": "巴音郭楞",
      "area": ["库尔勒", "轮台", "尉犁", "若羌", "且末", "焉耆", "和静", "和硕", "博湖"]
    }, {
      "name": "阿克苏",
      "area": ["阿克苏", "温宿", "库车", "沙雅", "新和", "拜城", "乌什", "阿瓦提", "柯坪"]
    }, {
      "name": "克孜勒苏",
      "area": ["阿图什", "阿克陶", "阿合奇", "乌恰"]
    }, {
      "name": "喀什",
      "area": ["喀什", "疏附", "疏勒", "英吉沙", "泽普", "莎车", "叶城", "麦盖提", "岳普湖", "伽师", "巴楚", "塔什库尔干塔吉克"]
    }, {
      "name": "和田",
      "area": ["和田", "和田", "墨玉", "皮山", "洛浦", "策勒", "于田", "民丰"]
    }, {
      "name": "伊犁",
      "area": ["伊宁", "奎屯", "霍尔果斯", "伊宁", "察布查尔锡伯", "霍城", "巩留", "新源", "昭苏", "特克斯", "尼勒克"]
    }, {
      "name": "塔城",
      "area": ["塔城", "乌苏", "额敏", "沙湾", "托里", "裕民", "和布克赛尔"]
    }, {
      "name": "阿勒泰",
      "area": ["阿勒泰", "布尔津", "富蕴", "福海", "哈巴河", "青河", "吉木乃"]
    }, {
      "name": "石河子",
      "area": []
    }, {
      "name": "阿拉尔",
      "area": []
    }, {
      "name": "图木舒克",
      "area": []
    }, {
      "name": "五家渠",
      "area": []
    }, {
      "name": "北屯",
      "area": []
    }, {
      "name": "铁门关",
      "area": []
    }, {
      "name": "双河",
      "area": []
    }, {
      "name": "可克达拉",
      "area": []
    }, {
      "name": "昆玉",
      "area": []
    }]
  }, {
    "name": "香港",
    "city": [{
      "name": "香港",
      "area": []
    }]
  }, {
    "name": "澳门",
    "city": [{
      "name": "澳门",
      "area": []
    }]
  }, {
    "name": "台湾",
    "city": [{
      "name": "台湾",
      "area": []
    }, {
      "name": "其他",
      "area": []
    }]
  }]
};
exports.data = data;